<template>
  <a-layout class="layout">
    <a-layout-sider :trigger="null"
                    class="layout-sider"
                    collapsible>
      <Sider :collapsed="collapsed"/>
    
    </a-layout-sider>
    <a-layout class="ant-layout">
      <a-layout-header class="ant-layout-header">
        <Header name="123" :count="count"/>
      </a-layout-header>
<!--      vue marquee <a-alert :message="text" type="info" closable
               style="margin: 10px 10px 0 10px;background-color:#fff;border: 0"/>-->
      <a-layout-content class="ant-layout-content" style="margin: 10px 10px 0 10px;">
        <Content :count="count"/>
      </a-layout-content>
      <a-layout-footer class="ant-layout-footer">
        <Footer/>
      </a-layout-footer>
    </a-layout>
  </a-layout>

</template>

<script>


import Footer from "./footer";
import Header from "./header";
import Content from "./content";
import Sider from "./sider";
import {defineComponent, ref} from 'vue';


export default defineComponent({
  name: "Layout",
  components: {
    Sider,
    Content,
    Header,
    Footer,
  },
  data() {
    return {}
  },
  setup() {
    const collapsed = false;
    const count = ref(10);
    const text = ref("发个红包稍等稍等开奖号圣诞节狂欢节狂欢节狂欢节开发接口很快就能电风扇看见你疯狂加你发的防空火箭稍等会今飞凯达数据库翻江倒海发个红包稍等稍等开奖号圣诞节狂欢节狂欢节狂欢节开发接口很快就能电风扇看见你疯狂加你发的防空火箭稍等会今飞凯达数据库翻江倒海发个红包稍等稍等开奖号圣诞节狂欢节狂欢节狂欢节开发接口很快就能电风扇看见你疯狂加你发的防空火箭稍等会今飞凯达数据库翻江倒海发个红包稍等稍等开奖号圣诞节狂欢节狂欢节狂欢节开发接口很快就能电风扇看见你疯狂加你发的防空火箭稍等会今飞凯达数据库翻江倒海发个红包稍等稍等开奖号圣诞节狂欢节狂欢节狂欢节开发接口很快就能电风扇看见你疯狂加你发的防空火箭稍等会今飞凯达数据库翻江倒海发个红包稍等稍等开奖号圣诞节狂欢节狂欢节狂欢节开发接口很快就能电风扇看见你疯狂加你发的防空火箭稍等会今飞凯达数据库翻江倒海发个红包稍等稍等开奖号圣诞节狂欢节狂欢节狂欢节开发接口很快就能电风扇看见你疯狂加你发的防空火箭稍等会今飞凯达数据库翻江倒海发个红包稍等稍等开奖号圣诞节狂欢节狂欢节狂欢节开发接口很快就能电风扇看见你疯狂加你发的防空火箭稍等会今飞凯达数据库翻江倒海发个红包稍等稍等开奖号圣诞节狂欢节狂欢节狂欢节开发接口很快就能电风扇看见你疯狂加你发的防空火箭稍等会今飞凯达数据库翻江倒海发个红包稍等稍等开奖号圣诞节狂欢节狂欢节狂欢节开发接口很快就能电风扇看见你疯狂加你发的防空火箭稍等会今飞凯达数据库翻江倒海发个红包稍等稍等开奖号圣诞节狂欢节狂欢节狂欢节开发接口很快就能电风扇看见你疯狂加你发的防空火箭稍等会今飞凯达数据库翻江倒海发个红包稍等稍等开奖号圣诞节狂欢节狂欢节狂欢节开发接口很快就能电风扇看见你疯狂加你发的防空火箭稍等会今飞凯达数据库翻江倒海发个红包稍等稍等开奖号圣诞节狂欢节狂欢节狂欢节开发接口很快就能电风扇看见你疯狂加你发的防空火箭稍等会今飞凯达数据库翻江倒海发个红包稍等稍等开奖号圣诞节狂欢节狂欢节狂欢节开发接口很快就能电风扇看见你疯狂加你发的防空火箭稍等会今飞凯达数据库翻江倒海发个红包稍等稍等开奖号圣诞节狂欢节狂欢节狂欢节开发接口很快就能电风扇看见你疯狂加你发的防空火箭稍等会今飞凯达数据库翻江倒海发个红包稍等稍等开奖号圣诞节狂欢节狂欢节狂欢节开发接口很快就能电风扇看见你疯狂加你发的防空火箭稍等会今飞凯达数据库翻江倒海发个红包稍等稍等开奖号圣诞节狂欢节狂欢节狂欢节开发接口很快就能电风扇看见你疯狂加你发的防空火箭稍等会今飞凯达数据库翻江倒海发个红包稍等稍等开奖号圣诞节狂欢节狂欢节狂欢节开发接口很快就能电风扇看见你疯狂加你发的防空火箭稍等会今飞凯达数据库翻江倒海发个红包稍等稍等开奖号圣诞节狂欢节狂欢节狂欢节开发接口很快就能电风扇看见你疯狂加你发的防空火箭稍等会今飞凯达数据库翻江倒海发个红包稍等稍等开奖号圣诞节狂欢节狂欢节狂欢节开发接口很快就能电风扇看见你疯狂加你发的防空火箭稍等会今飞凯达数据库翻江倒海发个红包稍等稍等开奖号圣诞节狂欢节狂欢节狂欢节开发接口很快就能电风扇看见你疯狂加你发的防空火箭稍等会今飞凯达数据库翻江倒海发个红包稍等稍等开奖号圣诞节狂欢节狂欢节狂欢节开发接口很快就能电风扇看见你疯狂加你发的防空火箭稍等会今飞凯达数据库翻江倒海发个红包稍等稍等开奖号圣诞节狂欢节狂欢节狂欢节开发接口很快就能电风扇看见你疯狂加你发的防空火箭稍等会今飞凯达数据库翻江倒海发个红包稍等稍等开奖号圣诞节狂欢节狂欢节狂欢节开发接口很快就能电风扇看见你疯狂加你发的防空火箭稍等会今飞凯达数据库翻江倒海发个红包稍等稍等开奖号圣诞节狂欢节狂欢节狂欢节开发接口很快就能电风扇看见你疯狂加你发的防空火箭稍等会今飞凯达数据库翻江倒海发个红包稍等稍等开奖号圣诞节狂欢节狂欢节狂欢节开发接口很快就能电风扇看见你疯狂加你发的防空火箭稍等会今飞凯达数据库翻江倒海发个红包稍等稍等开奖号圣诞节狂欢节狂欢节狂欢节开发接口很快就能电风扇看见你疯狂加你发的防空火箭稍等会今飞凯达数据库翻江倒海发个红包稍等稍等开奖号圣诞节狂欢节狂欢节狂欢节开发接口很快就能电风扇看见你疯狂加你发的防空火箭稍等会今飞凯达数据库翻江倒海发个红包稍等稍等开奖号圣诞节狂欢节狂欢节狂欢节开发接口很快就能电风扇看见你疯狂加你发的防空火箭稍等会今飞凯达数据库翻江倒海发个红包稍等稍等开奖号圣诞节狂欢节狂欢节狂欢节开发接口很快就能电风扇看见你疯狂加你发的防空火箭稍等会今飞凯达数据库翻江倒海发个红包稍等稍等开奖号圣诞节狂欢节狂欢节狂欢节开发接口很快就能电风扇看见你疯狂加你发的防空火箭稍等会今飞凯达数据库翻江倒海发个红包稍等稍等开奖号圣诞节狂欢节狂欢节狂欢节开发接口很快就能电风扇看见你疯狂加你发的防空火箭稍等会今飞凯达数据库翻江倒海发个红包稍等稍等开奖号圣诞节狂欢节狂欢节狂欢节开发接口很快就能电风扇看见你疯狂加你发的防空火箭稍等会今飞凯达数据库翻江倒海发个红包稍等稍等开奖号圣诞节狂欢节狂欢节狂欢节开发接口很快就能电风扇看见你疯狂加你发的防空火箭稍等会今飞凯达数据库翻江倒海发个红包稍等稍等开奖号圣诞节狂欢节狂欢节狂欢节开发接口很快就能电风扇看见你疯狂加你发的防空火箭稍等会今飞凯达数据库翻江倒海发个红包稍等稍等开奖号圣诞节狂欢节狂欢节狂欢节开发接口很快就能电风扇看见你疯狂加你发的防空火箭稍等会今飞凯达数据库翻江倒海发个红包稍等稍等开奖号圣诞节狂欢节狂欢节狂欢节开发接口很快就能电风扇看见你疯狂加你发的防空火箭稍等会今飞凯达数据库翻江倒海发个红包稍等稍等开奖号圣诞节狂欢节狂欢节狂欢节开发接口很快就能电风扇看见你疯狂加你发的防空火箭稍等会今飞凯达数据库翻江倒海发个红包稍等稍等开奖号圣诞节狂欢节狂欢节狂欢节开发接口很快就能电风扇看见你疯狂加你发的防空火箭稍等会今飞凯达数据库翻江倒海发个红包稍等稍等开奖号圣诞节狂欢节狂欢节狂欢节开发接口很快就能电风扇看见你疯狂加你发的防空火箭稍等会今飞凯达数据库翻江倒海发个红包稍等稍等开奖号圣诞节狂欢节狂欢节狂欢节开发接口很快就能电风扇看见你疯狂加你发的防空火箭稍等会今飞凯达数据库翻江倒海发个红包稍等稍等开奖号圣诞节狂欢节狂欢节狂欢节开发接口很快就能电风扇看见你疯狂加你发的防空火箭稍等会今飞凯达数据库翻江倒海发个红包稍等稍等开奖号圣诞节狂欢节狂欢节狂欢节开发接口很快就能电风扇看见你疯狂加你发的防空火箭稍等会今飞凯达数据库翻江倒海发个红包稍等稍等开奖号圣诞节狂欢节狂欢节狂欢节开发接口很快就能电风扇看见你疯狂加你发的防空火箭稍等会今飞凯达数据库翻江倒海发个红包稍等稍等开奖号圣诞节狂欢节狂欢节狂欢节开发接口很快就能电风扇看见你疯狂加你发的防空火箭稍等会今飞凯达数据库翻江倒海发个红包稍等稍等开奖号圣诞节狂欢节狂欢节狂欢节开发接口很快就能电风扇看见你疯狂加你发的防空火箭稍等会今飞凯达数据库翻江倒海发个红包稍等稍等开奖号圣诞节狂欢节狂欢节狂欢节开发接口很快就能电风扇看见你疯狂加你发的防空火箭稍等会今飞凯达数据库翻江倒海");
    
    return {
      collapsed,
      text,
      count
    }
  }
})
</script>

<style scoped>
.layout {
  display: flex;
  height: 100vh;
  overflow: hidden;
}

.layout .ant-layout {
  overflow: hidden;
}

.layout .layout-content {
}
</style>